HopeFOAM-0.1/tutorials/compressible/rhoCentralFoam/LadenburgJet60psi/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs ("libsampling.so");

interpolationScheme cellPointFace;

writeFormat     raw;

sampleSets
(
    face
    {
        name    cone25;
        axis    x;
        start   (0 0 0);
        end     (0.09208087 0.042939 0);
        nPoints 92;
    }
    face
    {
        name    cone55;
        axis    x;
        start   (0.09208087 0.042939 0);
        end     (0.153683 0.13092 0);
        nPoints 61;
    }
    face
    {
        name    base;
        axis    x;
        start   (0.153683 0.13092 0);
        end     (0.193675 0.13092 0);
        nPoints 40;
    }
);

fields          ( p wallHeatTransRate );


// ************************************************************************* //
